# Antigravity Extensions List
# Install all with: cat extensions.txt | xargs -L 1 antigravity --install-extension
# Or use: ./scripts/install-extensions.sh

# AI Assistants
anthropic.claude-code
kilocode.kilo-code
openai.chatgpt
google.gemini-cli-vscode-ide-companion
coderabbit.coderabbit-vscode
wuunuai.wuunu-ai-extension
sst-dev.opencode

# Antigravity Specific
n2ns.antigravity-panel
jlcodes.antigravity-cockpit

# Development Tools
github.vscode-github-actions
qwtel.sqlite-viewer
davidanson.vscode-markdownlint

# PHP Development
devsense.phptools-vscode
devsense.composer-php-vscode
devsense.intelli-php-vscode
devsense.profiler-php-vscode

# Python Development
ms-python.python
ms-python.debugpy
ms-python.vscode-python-envs
meta.pyrefly

# Java Development
redhat.java
vscjava.vscode-java-pack
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-test
vscjava.vscode-maven
vscjava.vscode-gradle

# Other Languages
golang.go
shopify.ruby-lsp
llvm-vs-code-extensions.vscode-clangd

# Container & Cloud
ms-azuretools.vscode-docker
ms-azuretools.vscode-containers

# Custom Theme (install manually from themes/ folder)
# drake-corsair.corsairhud-plus-theme
